[
["Arriving alone, an air mattress awaits",
"A chapter starts, twenty-five hundred miles from home",
"An old friend in a new place, cloudy skies and the time",
"To think"],

["From freezing heights of Pilchuck ",
"To deep bass in basements",
"How many hours did we spend",
"More than a hundred feet a part",
"In six months of our lives?"],

["How many brain toasted evenings when we needed to sit",
"In the car after work, before driving a bit"],

["You learned how to drive, we learned not to use chairs",
"To sip on five stones and get sun though it's scarce"],

["Where are they now, all those drives that we shared?",
"Some so quiet and exhausted, some laughing, some scared"],

["They are frozen in spacetime, trapped in the amber, ",
"Where there is no present or past, those moments reside",
"In perfect clarity, eternally intertwined threads of our lives",
"Delicately interwoven in 621, and SE04",
"Each feeling and smile and laugh",
"Exactly as it has always been",
"Only the present has swept as our memories fade",
"As the passage of time leaves but a second a day"],

["I can't focus on the thoughts that what we had",
"Which we will never have again",
"Because what we had then, the time and the peace",
"The tofu, the rainfall, the beanbag in the corner",
"The acid trip when we said goodbye",
"And together looked back and were glad",
"It's just so goddamn special",
"It's the kind of thing that if you're lucky",
"You get to share with one person, maybe two",
"In a lifetime.",
"And I shared it with you.",
"It's a calm it's the love of living the routine with a friend that you trust"],


["All those elevator trips, ",
"Times we laid on the rug",
"All the plants all the tiles",
"Our share of shared hugs"],


["Dancing downtown, wandering the halls of Costco and Ikea",
"A glimpse of life ahead, of quiet routines, of quiet weeks.",
"A handful of cigarettes, a boat load of code,",
"Writing our names in the night sky, day by day.",
"The nights when concern for each other",
"Was the only reason we left the office at all",
"Three nights in a row watching young love bloom on a laptop screen"]
]
